{
  "careers": [
    {
      "title": "Dental Hygienist",
      "subtitle": "",
      "location": "Landsdale, PA",
      "type": "Full Time",
      "experience": "Mid Level, 2+ years experience",
      "summary": "As a Hygienist, you will clean patient teeth and examine oral areas, head, and neck for signs of oral disease. You will educate patients on oral hygiene, take and develop x rays, and apply fluoride or sealants.",
      "requirements": {
      	"1": "2 years minimum of prior Hygienist experience",
      	"2": "State of Pennsylvania Hygiene license (RDH) required",
      	"3": "Current CPR certificate (BLSC) required",
      	"4": "Minimum of an associate’s degree from an accredited Hygiene program",
      	"5": "Current on Hepatitis B vaccination",
      	"6": "Ability to administer local anesthetic agents",
      	"7": "Excellent verbal, written, and interpersonal communication skills",
      	"8": "Proficient with basic PC skills"
      	},
      "responsibilities": {
      	"1": "Removing calculus deposits, accretions, stains, and/or cement from supra and sub gingival surfaces of the teeth",
      	"2": "Performing deep periodontal scaling, including root planning when prescribed",
      	"3": "Completing extra oral and intra-oral cancer exams and feeling lymph nodes on head and neck area to detect swelling or tenderness that could indicate presence of oral cancer",
      	"4": "Examining teeth and attachment to locate periodontally recessed tissue and/or signs of periodontal disease prior to exam by Dentist",
      	"5": "Charting conditions of decay and disease, for treatment as diagnosed by Dentist",
      	"6": "Assisting during examinations",
      	"7": "Exhibiting excellent customer service to create a positive patient experience and ensuring all treatment is provided with an awareness of individual patient’s needs and concerns"
      	}
    },
    {
    	"title": "Dental Secretary",
      	"subtitle": "",
      	"location": "Landsdale, PA",
      	"type": "Full Time",
      	"experience": "2+ years experience",
      	"summary": "The qualified Dental Secretary plays a vital role and ensures the day-to-day management of the dental practice. Responsibilities include managing the office and office supplies, interacting with insurance companies, scheduling patients, filing, and setting up patient charts and records. The Dental Secretary oversees all functions and budgets for our very busy office.",
      	"requirements": {
      		"1": "Intermediate Medical Typing",
      		"2": "Soft Dental preferred",
      		"3": "Customer Service Experience",
      		"4": "Intermediate MS Excel",
      		"5": "Familiarity with medical terminology, claims management and filing procedures is required",
      		"6": "Attention to detail",
      		"7": "Highly organized"
      	}
    }
  ]
}